erp3l/src/Catalogs/СпособыРасчетаДнейПериодическихОпераций/СпособыРасчетаДнейПериодическихОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыРасчетаДнейПериодическихОпераций</name>
  <predefined>
    <items>
      <name>Год360Месяц30</name>
      <description>Год: 360 дней, месяц: 30 дней</description>
    </items>
    <items>
      <name>Год360МесяцФакт</name>
      <description>Год: 360 дней, месяц: по факту</description>
    </items>
    <items>
      <name>ГодФактМесяц30</name>
      <description>Год: по факту, месяц: 30 дней</description>
    </items>
    <items>
      <name>ГодФактМесяцФакт</name>
      <description>Год: по факту, месяц: по факту</description>
    </items>
  </predefined>
  <attributes>
    <name>ДнейВГоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДнейВМесяце</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоФактуГод</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоФактуМесяц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/СпособыРасчетаДнейПериодическихОпераций/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПоФактуГодПриИзменении(Элемент)
	
	Если Объект.ПоФактуГод Тогда
		
		Объект.ДнейВГоду=0;
		
	КонецЕсли;
	
	Элементы.ДнейВГоду.Доступность=НЕ Объект.ПоФактуГод;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоФактуМесяцПриИзменении(Элемент)
	
	Если Объект.ПоФактуМесяц Тогда
		
		Объект.ДнейВМесяце=0;
		
	КонецЕсли;
	
	Элементы.ДнейВМесяце.Доступность=НЕ Объект.ПоФактуМесяц;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ДнейВМесяце.Доступность= НЕ Объект.ПоФактуМесяц;
	Элементы.ДнейВГоду.Доступность	= НЕ Объект.ПоФактуГод;
	
	Элементы.ГруппаГод.Видимость	= Не Объект.Предопределенный;
	Элементы.ГруппаМесяц.Видимость	= Не Объект.Предопределенный;
	
КонецПроцедуры
